/* ************************************************ */
/*	Thumbnail_Read_IF.h							*/
/*	2015/4/27										*/
/*	by Yuki.KIshimoto								*/
/* ************************************************ */

#ifndef THUMBNAIL_TASK_H
#define THUMBNAIL_TASK_H "0.01"

/* ============================================================================================== */
/* 	外部関数のプロトタイプ宣言：他モジュールでも使用する関数宣言                                  */
/* ============================================================================================== */
/* ---------------------------------------------------------------------------------------------- */
/* 	機能関数                                                                                      */
/* ---------------------------------------------------------------------------------------------- */
void Thumbnail_Read_Task();						/* Exif 取得処理 */

/* ---------------------------------------------------------------------------------------------- */
/* 	外部I/F関数                                                                                   */
/* ---------------------------------------------------------------------------------------------- */
void Thumbnail_Task_SetFileName(char *buf[]);
void Thumbnail_Task_SetFilePointer(FILE *fp);

PIC_DATA *Thumbnail_Task_GetPictureData(void);

long Thumbnail_Task_GetThumbnailOffset(void);
long Thumbnail_Task_GetThumbnailSize(void);

int Thumbnail_Task_GetPictureType(void);

#endif		// THUMBNAIL_TASK_H